'''
Завдання 1

Створіть функцію, яка відображає привітання для користувача із заданим ім'ям.
Якщо ім'я не вказано, вона повинна виводити привітання для користувача з Вашим ім'ям.
'''

def hello(name):
    if name is None:
        print("Здравствуйте, Владислав!")
    else:
        print("Здравствуйте, ", name)


name = input("Введите ваше имя: ")
hello(name)

'''Завдання 2
Створіть дві функції, що обчислюють значення певних алгебраїчних виразів.
На екрані виведіть таблицю значень цих функцій від -5 до 5 з кроком 0.5.
'''

import math


def func1(x):
    return pow(x, 2) + 3 * x - 1


def func2(x):
    return math.sin(x) + math.cos(x)


print("x | Функция 1 | Функция 2 ")
print("--------------------------")
for x in range(-10, 11):
    x = x / 2
    result1 = func1(x)
    result2 = func2(x)
    print("{} |  {:.3f}   |  {:.3f}   ".format(x, result1, result2))

'''
Завдання 3

Створіть програму-калькулятор, яка підтримує наступні операції:
додавання, віднімання, множення, ділення,
зведення в ступінь, зведення до квадратного та кубічного коренів.
Всі дані повинні вводитися в циклі, доки користувач не вкаже,
що хоче завершити виконання програми.
Кожна операція має бути реалізована у вигляді окремої функції.
Функція ділення повинна перевіряти дані на коректність
та видавати повідомлення про помилку у разі спроби поділу на нуль.
'''
import math


def add(a, b):
    return a + b


def substract(a, b):
    return a - b


def multiply(a, b):
    return a * b


def divide(a, b):
    if b != 0:
        return a / b
    else:
        print("Ошибка, деление на ноль невозможно")
        return None


def power(a, b):
    return pow(a, b)


def square_root(a):
    if a >= 0:
        return math.sqrt(a)
    else:
        print("Ошибка, у отрицательного числа нет корней")
        return None


def cube_root(a):
    if a >= 0:
        return a ** (1 / 3)
    else:
        print("Ошибка, у отрицательного числа нет корней")
        return None


while True:
    option = input("Меню:\n"
                   "----------\n"
                   "1. Сумма\n"
                   "2. Разница\n"
                   "3. Умножение\n"
                   "4. Деление\n"
                   "5. Возведение в степень\n"
                   "6. Квадратный корень\n"
                   "7. Кубический корень\n"
                   "8. Выход\n"
                   "----------\n"
                   "Выберите операцию: ")
    if option in ["1", "2", "3", "4", "5", "6", "7"]:
        num1 = float(input("Введите первое число: "))
        if option != "6" and option != "7":
            num2 = float(input("Введите второе число: "))
            print()

    match option:
        case "1":
            print("Результат: ", add(num1, num2), "\n")
        case "2":
            print("Результат: ", substract(num1, num2), "\n")
        case "3":
            print("Результат: ", multiply(num1, num2), "\n")
        case "4":
            print("Результат: ", divide(num1, num2), "\n")
        case "5":
            print("Результат: ", power(num1, num2), "\n")
        case "6":
            print("Результат: ", square_root(num1), "\n")
        case "7":
            print("Результат: ", cube_root(num1), "\n")
        case "8":
            break
        case _:
            print("Неверный ввод, попробуйте еще раз\n")


# Завдання 4
#
# Створіть програму, яка складається з функції,
# яка приймає три числа і повертає їх середнє арифметичне, і головного циклу,
# що запитує у користувача числа і обчислює їх середні значення за допомогою створеної функції.

def arithmetic_mean(a, b, c):
    return (a + b + c) / 3


while True:
    try:
        num1 = float(input("Введите первое число: "))
        num2 = float(input("Введите второе число: "))
        num3 = float(input("Введите третье число: "))
        print("Среднее арифметическое = ", arithmetic_mean(num1, num2, num3), "\n")
    except ValueError:
        print("Ошибка, введите число!")
    stop = input("Продолжить? Да/Нет: ")
    if stop == "Нет":
        break

# Завдання 5
#
# Створіть програму, яка приймає як формальні параметри зріст і вагу користувача,
# обчислює індекс маси тіла і в залежності від результату повертає інформаційне повідомлення
# (маса тіла в нормі, недостатня вага або слідкуйте за фігурою).
# Користувач з клавіатури вводить значення росту та маси тіла та передає ці дані у вигляді
# фактичних параметрів під час виклику функції.
# Програма працює доти, доки користувач не зупинить її комбінацією символів «off».

import math


def calc_bmi(height, weight):
    bmi = weight / pow(height, 2)
    return bmi


def print_bmi(bmi):
    if bmi < 18.5:
        return "Недостаточный вес"
    elif bmi > 18.5 < 25:
        return "Масса тела в норме"
    else:
        return "Избыточный вес"


while True:
    print("Калькулятор индекса массы тела\n"
          "-------------------------------")
    height = float(input("Введите рост в метрах: "))
    weight = float(input("Введите вес в килограммах: "))
    bmi = calc_bmi(height, weight)
    print("Индекс массы тела - {:.2f}. {}\n".format(bmi, print_bmi(bmi)))

    stop = input("Продолжить? Введите \"off\" , чтобы остановить:  ")
    if stop == "off":
        break
