# Завдання 1

# Дано числа a і b (a < b). Виведіть суму всіх натуральних чисел від a до b (включно).

a = int(input("Input number a: "))
b = int(input("Input number b: "))
x = 0
if a > b:
    print("Error")
else:
    for n in range(a, b + 1):
        x += n
    print(x)

# Завдання 2

# Факторіалом числа n називається число n!=1∙2∙3∙…∙n. Створіть програму, яка обчислює факторіал введеного користувачем числа.

x = int(input("Input number: "))

for n in range(1, x):
    x *= n
print(x)

# Завдання 3

# Використовуючи вкладені цикли та функції print(‘*’, end=’’), print(‘ ‘, end=’’) та print() виведіть на екран прямокутний трикутник

n = int(input("Введите число рядков: "))
for i in range(n):
    for j in range(i + 1):
        print('*', end="")
    print()

# Завдання 4

# Дано числа a і b (a < b).
# Виведіть на екран суму всіх натуральних чисел від a до b (включно),
# які є кратними середньому арифметичному цього проміжку.

a = int(input("Input a: "))
b = int(input("Input b: "))
mid = (a + b) / 2
total = 0
for n in range(a, b + 1):
    if n % mid == 0:
        total += 1
        print("Сумма равна: ", total)

# Завдання 5

# Створіть програму, яка малює на екрані прямокутник із зірочок заданою користувачем ширини та висоти.

a = int(input("Введите ширину: "))
b = int(input("Введите высоту"))
for n in range(a):
    for n in range(b):
        print("*", end="")
    print()

# Завдання 6

# Створіть програму авторизації, в якій користувачеві дається 3 спроби ввести свої облікові дані (логін та пароль).
# Якщо користувач за меншу кількість спроб ввів вірні дані, програма достроково припиняє своє виконання та виводить на екран повідомлення:
# «Авторизацію успішно пройдено з «№» спроби».

login = "admin"
password = "password"
for n in range(3):
    user_login = input("Введите логин: ")
    user_password = input("Введите пароль: ")
    if login == user_login and password == user_password:
        print("Авторизацію успішно пройдено з", n + 1, "спроби")
    else:
        print("Логин или пароль введен наверно")
