# Завдання 1

#Напишіть програму, яка запитує у користувача його ім'я, якщо воно збігається з вашим, видає певне повідомлення.

name = input("Введите ваше имя: ")
if name == "Vladyslav":
    print("О, тезка")
else:
    print("Приятно познакомиться, " + name)


# Завдання 2

# Напишіть програму, яка обчислює значення функції 𝑦 = cos(3x), де - 𝜋 <= x <= 𝜋 та вводиться з клавіатури. Відповідь подати у радіанах.

import math
x = float(input("Введите число x, которое больше -Пи и меньше Пи: "))
if x > -math.pi and x < math.pi:
    y = math.cos(3 * x)
    print(f'y = {y}')
else:
    print("Ошибка")

# Завдання 3

'''
Напишіть програму, яка розв'язує квадратне рівняння 𝑎𝑥 2 + 𝑏𝑥 + 𝑐 = 0 у дійсних числах. 
На відміну від аналогічної вправи з минулого уроку, програма повинна видавати повідомлення про відсутність дійсних коренів, 
якщо значення дискримінанта 𝐷 = 𝑏 2 −4𝑎𝑐 негативне, єдине рішення 𝑥 = − 𝑏 / 2𝑎 , якщо він дорівнює нулю, або два корені 𝑥1,2 = −b±D−−√/2a
, якщо він позитивний.
'''

a = int(input("Введите число a: "))
b = int(input("Введите число b: "))
c = int(input("Введите число c: "))

discriminant = pow(b, 2) - 4 * a * c
if discriminant < 0:
        print("Корней нет")
elif discriminant == 0:
        x = (-b + pow(discriminant, 1 / 2)) / (2 * a)
        print(f'"Корень один и равен =" {x}')
else:
        x1 = (-b + pow(discriminant, 1 / 2)) / (2 * a)
        x2 = (-b - pow(discriminant, 1 / 2)) / (2 * a)
        print(f'Первый корень: {x1}')
        print(f'Второй корень: {x2}')


# Завдання 4

'''Напишіть програму-калькулятор, в якій користувач зможе обрати операцію, ввести необхідні числа та отримати результат.
Операції, які необхідно реалізувати: додавання, віднімання, множення, ділення, зведення в ступінь,
квадратний корінь, кубічний корінь, синус, косинус та тангенс числа.
'''
import math

option = input("Выберите операцию:\n 1 - додавання\n 2 - віднімання\n 3 - множення\n 4 - ділення\n "
      "5 - зведення в ступінь\n 6 - квадратний корінь\n 7 - кубічний корінь\n 8 - синус\n 9 - косинус\n 10 - тангенс\n")
match option:
    case '1':
        print("Додавання")
        a = float(input("Введите число a: "))
        b = float(input("Введите число b: "))
        print(f'Результат = {a + b}')
    case '2':
        print("Віднімання")
        a = float(input("Введите число a: "))
        b = float(input("Введите число b: "))
        print(f'Результат = {a - b}')
    case '3':
        print("Множення")
        a = float(input("Введите число a: "))
        b = float(input("Введите число b: "))
        print(f'Результат = {a * b}')
    case '4':
        print("Ділення")
        a = float(input("Введите число a: "))
        b = float(input("Введите число b: "))
        print(f'Результат = {a / b}')
    case '5':
        print("Зведення в ступінь")
        a = float(input("Введите число a: "))
        b = float(input("Введите число b: "))
        print(f'Результат = {pow(a , b)}')
    case '6':
        print("Квадратний корінь")
        a = float(input("Введите число a: "))
        print(f'Результат = {math.sqrt(a)}')
    case '7':
        print("Кубічний корінь")
        a = float(input("Введите число a: "))
        print(f'Результат = {a ** (1 / 3)}')
    case '8':
        print("Синус")
        a = float(input("Введите число a: "))
        print(f'Результат = {math.sin(a)}')
    case '9':
        print("Косинус")
        a = float(input("Введите число a: "))
        print(f'Результат = {math.cos(a)}')
    case '10':
        print("Тангенс")
        a = float(input("Введите число a: "))
        print(f'Результат = {math.tan(a)}')
    case _:
        print("Ошибка")



# Завдання 5

'''
Напишіть програму для перевірки введеного числа на ознаку парності.
Якщо число парне/непарне – вивести відповідне повідомлення на екран.
Для опису цього алгоритму використовувати тернарний оператор.
'''

x = float(input("Введите число: "))
if x % 2 == 0:
    print("Четное")
else:
    print("Не четное")



# Завдання 6

'''
Написати програму визначення днів тижня.
Дані про день тижня вводяться користувачем з клавіатури.
Якщо будній день - виводити на екран повідомлення "Сьогодні на роботу", у вихідні дні - "Сьогодні вихідний", в інших випадках - "Такого дня не існує".
'''

day = input("Введите день недели: ")
match day:
    case 'Понедельник' | 'Вторник' | 'Среда' | 'Четверг' | 'Пятница':
        print("Сьогодні на роботу")
    case 'Суббота' | 'Воскресенье':
        print("Сьогодні вихідний")
    case _:
        print("Такого дня не існує")


