import math
import random

# Завдання 1
#
# Створіть список та введіть його значення.
# Знайдіть найбільший та найменший елемент списку, а також суму та середнє арифметичне його значень.

my_list = list(map(int, (input("Введите значения для первого списка: ").split())))
print(f"Самый большой элемент списка = {max(my_list)}\n"
      f"Самый маленький элемент списка = {min(my_list)}\n"
      f"Сумма элементов списка = {sum(my_list)}\n"
      f"Среднее арифметическое значений списка = {sum(my_list) / len(my_list)}\n")

# Завдання 2
#
# Є два списки, які наповнюються користувачем з клавіатури.
# Сформувати список, в якому будуть міститися унікальні
# значення першого відносно другого списку та навпаки без повторень.
# Роздрукувати підсумковий об'єкт на екран в прямій послідовності, зворотній,
# а також виконати сортування за зростанням та спаданням.


first_list = list(map(int, (input("Введите значения для первого списка: ").split())))
print(first_list)
second_list = list(map(int, (input("Введите значения для второго списка: ").split())))
print(second_list)
refactor_list = []
for n in first_list:
    if n not in second_list:
        refactor_list.append(n)
print(f"Список с уникальными значениями в прямой последовательнсти- {refactor_list}\n"
      f"В обратной - {refactor_list[::-1]}\n"
      f"Сортировка по увеличению - {sorted(refactor_list)}\n"
      f"По уменьшению - {sorted(refactor_list, reverse=True)}")

# Завдання 3
#
# Простим називається число, яке ділиться націло лише на одиницю і на саме себе.
# Число 1 не вважається простим. Напишіть програму,
# яка знаходить усі прості числа в заданому проміжку, виводить їх на екран,
# а потім на вимогу користувача виводить їхню суму або добуток.


a = int(input("Введите число с которого начинается диапозон: "))
while a == 1:
    a = int(input("Введите число с которого начинается диапозон: "))
b = int(input("Введите число которым заканчивается диапозон: "))
my_list = []
for i in range(a, b + 1):
    for j in range(a, i):
        if i % j == 0:
            break
    else:
        my_list.append(i)
print(f"Простые числа в указанном диапозоне - {my_list}")
n = int(input("Что вы хотете сделать?\n"
              "1. Найти сумму элементов списка\n"
              "2. Перемножить элементы списка\n"
              "- "))
while n in (1, 2):
    if n == 1:
        print(f"Сумма элементов списка = {sum(my_list)}")
    else:
        print(f"Умножение элементов списка = {math.prod(my_list)}")
    break
else:
    n = int(input("Что вы хотете сделать?\n"
                  "1. Найти сумму элементов списка\n"
                  "2. Перемножить элементы списка\n"
                  "- "))

# Завдання 4
#
# Створіть цілочисельний список, введіть кількість його елементів і самі значення.
# Передбачити меню, в якому:
# після натискання клавіші 1 ці значення виведуться на екран у зворотному порядку,
# а після натискання клавіші 2 – за зростанням.

my_list_len = int(input("Введите длинну списка: "))
my_list = []
NUM = 0
for n in range(my_list_len):
    num = int(input(f"Введите значение {n + 1} элемента: "))
    my_list.append(num)
print("Ваш список - ", my_list)
while True:
    option = input("Что сделать?\n"
                   "1. Вывести список в обратном порядке\n"
                   "2. Вывести список на увеличение\n"
                   "3. Выход\n"
                   "Введите номер операции: ")
    if option == "1":
        print(my_list[:: -1])
    elif option == "2":
        print(sorted(my_list))
    elif option == "3":
        print("До свиданья.")
        break
    else:
        print("Неправильный ввод")

# Завдання 5
#
# Створіть список натуральних чисел int_list.
# Кожне непарне значення списку додайте до нового списку new_list.
# Користувач вводить з клавіатури кількість повторів списку repeat.
# Здійсніть дублювання списку new_list, repeat кількість разів. Очистіть список int_list.


int_list = []
list_len = int(input("Введите длинну списка: "))
for n in range(list_len):
    int_list.append(random.randint(1, 20))
print("Список натуральных чисел - ", int_list)
new_list = []
for m in int_list:
    if m % 2 != 0:
        new_list.append(m)
print("Новый список - ", new_list)
repeat = int(input("Сколько раз повторить список?\n"))
dup_list = new_list * repeat
print("Дублированый список - ", dup_list)
int_list.clear()

# Завдання 6
#
# Для цього завдання вихідний список значень беремо з підсумкового списку new_list завдання 5.
# Користувач вводить з клавіатури значення;
# якщо таке є у цьому списку — вивести кількість його повторів та його позицію у цьому списку.

value = int(input("Введите значение: "))
for j in new_list:
    if value == j:
        print(f"Значение повторяется {new_list.count(j)} раз, "
              f"и находится за индексом {new_list.index(j)}")
        break
    else:
        print("В списке нет такого значения")
